export default function QuestionIcon({ fillColor, size }) {
  return (
    <svg
      fill={fillColor}
      height={size}
      width={size}
      xmlns="http://www.w3.org/2000/svg"
      viewBox="0 0 64.61 97"
    >
      <g id="Слой_2" data-name="Слой 2">
        <g id="Слой_1-2" data-name="Слой 1">
          <path
            fill={fillColor}
            d="M25.12,71.82a10,10,0,0,1-10-9.38c-.27-4.34-.61-12.21.17-16.13C17,38.13,24.9,37,30.69,36.22c13-1.82,13.92-3.88,13.92-7.07,0-2.72-4.62-6.69-12.34-8.62-6.55-1.64-15.75.91-18.74,2A10,10,0,0,1,6.42,3.87c1.69-.64,16.88-6.2,30.7-2.75,16.7,4.18,27.49,15.18,27.49,28,0,21.37-20.37,25.31-29.73,26.67,0,1.71.12,3.59.23,5.38a10,10,0,0,1-9.36,10.6Z"
          />
          <rect
            fill={fillColor}
            x="13.42"
            y="76.41"
            width="24.03"
            height="20.59"
            rx="10.12"
          />
        </g>
      </g>
    </svg>
  );
}
